chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>P5SEL0</name>
          <description>Port 5 Selection 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P5SEL0_0</name>
              <description>P5SEL0_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_1</name>
              <description>P5SEL0_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_2</name>
              <description>P5SEL0_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_3</name>
              <description>P5SEL0_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_4</name>
              <description>P5SEL0_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_5</name>
              <description>P5SEL0_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_6</name>
              <description>P5SEL0_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL0_7</name>
              <description>P5SEL0_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>P6SEL0</name>
          <description>Port 6 Selection 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P6SEL0_0</name>
              <description>P6SEL0_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_1</name>
              <description>P6SEL0_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_2</name>
              <description>P6SEL0_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_3</name>
              <description>P6SEL0_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_4</name>
              <description>P6SEL0_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_5</name>
              <description>P6SEL0_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_6</name>
              <description>P6SEL0_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL0_7</name>
              <description>P6SEL0_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>P5SEL1</name>
          <description>Port 5 Selection 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P5SEL1_0</name>
              <description>P5SEL1_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_1</name>
              <description>P5SEL1_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_2</name>
              <description>P5SEL1_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_3</name>
              <description>P5SEL1_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_4</name>
              <description>P5SEL1_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_5</name>
              <description>P5SEL1_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_6</name>
              <description>P5SEL1_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SEL1_7</name>
              <description>P5SEL1_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>P6SEL1</name>
          <description>Port 6 Selection 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P6SEL1_0</name>
              <description>P6SEL1_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_1</name>
              <description>P6SEL1_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_2</name>
              <description>P6SEL1_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_3</name>
              <description>P6SEL1_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_4</name>
              <description>P6SEL1_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_5</name>
              <description>P6SEL1_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_6</name>
              <description>P6SEL1_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SEL1_7</name>
              <description>P6SEL1_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>P5SELC</name>
          <description>Port 5 Complement Selection</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P5SELC_0</name>
              <description>P5SELC_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_1</name>
              <description>P5SELC_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_2</name>
              <description>P5SELC_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_3</name>
              <description>P5SELC_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_4</name>
              <description>P5SELC_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_5</name>
              <description>P5SELC_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_6</name>
              <description>P5SELC_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5SELC_7</name>
              <description>P5SELC_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>P6SELC</name>
          <description>Port 6 Complement Selection</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>P6SELC_0</name>
              <description>P6SELC_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_1</name>
              <description>P6SELC_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_2</name>
              <description>P6SELC_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_3</name>
              <description>P6SELC_3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_4</name>
              <description>P6SELC_4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_5</name>
              <description>P6SELC_5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_6</name>
              <description>P6SELC_6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6SELC_7</name>
              <description>P6SELC_7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
