chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>RTCCTL0</name>
          <description>Real Timer Clock Control 0/Key</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCRDYIFG</name>
              <description>RTC Ready Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAIFG</name>
              <description>RTC Alarm Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTEVIFG</name>
              <description>RTC Time Event Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOFIFG</name>
              <description>RTC 32kHz cyrstal oscillator fault interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCRDYIE</name>
              <description>RTC Ready Interrupt Enable Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAIE</name>
              <description>RTC Alarm Interrupt Enable Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTEVIE</name>
              <description>RTC Time Event Interrupt Enable Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOFIE</name>
              <description>RTC 32kHz cyrstal oscillator fault interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTL13</name>
          <description>Real Timer Clock Control 1/3</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCTEV</name>
              <description>RTC Time Event 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCTEV_0</name>
                  <description>RTC Time Event: 0 (Min. changed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_1</name>
                  <description>RTC Time Event: 1 (Hour changed)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_2</name>
                  <description>RTC Time Event: 2 (12:00 changed)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_3</name>
                  <description>RTC Time Event: 3 (00:00 changed)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSSEL</name>
              <description>RTC Source Select 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCSSEL_0</name>
                  <description>RTC Source Select ACLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSSEL_1</name>
                  <description>RTC Source Select SMCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSSEL_2</name>
                  <description>RTC Source Select RT1PS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSSEL_3</name>
                  <description>RTC Source Select RT1PS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCRDY</name>
              <description>RTC Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCMODE</name>
              <description>RTC Mode 0:Counter / 1: Calendar</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCHOLD</name>
              <description>RTC Hold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCBCD</name>
              <description>RTC BCD  0:Binary / 1:BCD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCALF</name>
              <description>RTC Calibration Frequency Bit 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCALF_0</name>
                  <description>RTC Calibration Frequency: No Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_1</name>
                  <description>RTC Calibration Frequency: 512 Hz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_2</name>
                  <description>RTC Calibration Frequency: 256 Hz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_3</name>
                  <description>RTC Calibration Frequency: 1 Hz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCOCAL</name>
          <description>Real Timer Clock Offset Calibartion</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCOCAL0</name>
              <description>RTC Offset Calibration Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL1</name>
              <description>RTC Offset Calibration Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL2</name>
              <description>RTC Offset Calibration Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL3</name>
              <description>RTC Offset Calibration Bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL4</name>
              <description>RTC Offset Calibration Bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL5</name>
              <description>RTC Offset Calibration Bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL6</name>
              <description>RTC Offset Calibration Bit 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCAL7</name>
              <description>RTC Offset Calibration Bit 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOCALS</name>
              <description>RTC Offset Calibration Sign</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCTCMP</name>
          <description>Real Timer Temperature Compensation</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCTCMP0</name>
              <description>RTC Temperature Compensation Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP1</name>
              <description>RTC Temperature Compensation Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP2</name>
              <description>RTC Temperature Compensation Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP3</name>
              <description>RTC Temperature Compensation Bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP4</name>
              <description>RTC Temperature Compensation Bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP5</name>
              <description>RTC Temperature Compensation Bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP6</name>
              <description>RTC Temperature Compensation Bit 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMP7</name>
              <description>RTC Temperature Compensation Bit 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCOK</name>
              <description>RTC Temperature compensation write OK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCRDY</name>
              <description>RTC Temperature compensation ready</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTCMPS</name>
              <description>RTC Temperature Compensation Sign</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCPS0CTL</name>
          <description>Real Timer Prescale Timer 0 Control</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RT0PSIFG</name>
              <description>RTC Prescale Timer 0 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT0PSIE</name>
              <description>RTC Prescale Timer 0 Interrupt Enable Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT0IP</name>
              <description>RTC Prescale Timer 0 Interrupt Interval Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0IP_0</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_1</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_2</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_3</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_4</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_5</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_6</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_7</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT0PSHOLD</name>
              <description>RTC Prescale Timer 0 Hold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT0PSDIV</name>
              <description>RTC Prescale Timer 0 Clock Divide Bit: 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0PSDIV_0</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_1</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_2</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_3</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_4</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_5</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_6</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0PSDIV_7</name>
                  <description>RTC Prescale Timer 0 Clock Divide: /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
