chrismolli/msp430fr6972/svd/msp430fr6972.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_B1_SPI_MODE</name>
      <description>USCI_B1  SPI Mode</description>
      <baseAddress>1664</baseAddress>
      <registers>
        <register>
          <name>UCB1CTL1_SPI</name>
          <description>USCI B1 Control Register 1</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB1CTL0_SPI</name>
          <description>USCI B1 Control Register 0</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB1BR0_SPI</name>
          <description>USCI B1 Baud Rate 0</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB1BR1_SPI</name>
          <description>USCI B1 Baud Rate 1</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB1RXBUF_SPI</name>
          <description>USCI B1 Receive Buffer</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCB1TXBUF_SPI</name>
          <description>USCI B1 Transmit Buffer</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCB1IE_SPI</name>
          <description>USCI B1 Interrupt Enable Register</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>USCI Receive Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>USCI Transmit Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB1IFG_SPI</name>
          <description>USCI B1 Interrupt Flags Register</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>SPI Receive Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>SPI Transmit Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB1IV_SPI</name>
          <description>USCI B1 Interrupt Vector Register</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD_C</name>
      <description>LCD_C</description>
      <baseAddress>2560</baseAddress>
      <registers>
        <register>
          <name>LCDM1</name>
          <description>LCD Memory 1</description>
          <addressOffset>32</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM2</name>
          <description>LCD Memory 2</description>
          <addressOffset>33</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM3</name>
          <description>LCD Memory 3</description>
          <addressOffset>34</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM4</name>
          <description>LCD Memory 4</description>
          <addressOffset>35</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM5</name>
          <description>LCD Memory 5</description>
          <addressOffset>36</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM6</name>
          <description>LCD Memory 6</description>
          <addressOffset>37</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM7</name>
          <description>LCD Memory 7</description>
          <addressOffset>38</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM8</name>
          <description>LCD Memory 8</description>
          <addressOffset>39</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM9</name>
          <description>LCD Memory 9</description>
          <addressOffset>40</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM10</name>
          <description>LCD Memory 10</description>
          <addressOffset>41</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM11</name>
          <description>LCD Memory 11</description>
          <addressOffset>42</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM12</name>
          <description>LCD Memory 12</description>
          <addressOffset>43</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM13</name>
          <description>LCD Memory 13</description>
          <addressOffset>44</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM14</name>
          <description>LCD Memory 14</description>
          <addressOffset>45</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM15</name>
          <description>LCD Memory 15</description>
          <addressOffset>46</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM16</name>
          <description>LCD Memory 16</description>
          <addressOffset>47</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM17</name>
          <description>LCD Memory 17</description>
          <addressOffset>48</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM18</name>
          <description>LCD Memory 18</description>
          <addressOffset>49</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM19</name>
          <description>LCD Memory 19</description>
          <addressOffset>50</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM20</name>
          <description>LCD Memory 20</description>
          <addressOffset>51</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM21</name>
          <description>LCD Memory 21</description>
          <addressOffset>52</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM22</name>
          <description>LCD Memory 22</description>
          <addressOffset>53</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM23</name>
          <description>LCD Memory 23</description>
          <addressOffset>54</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM24</name>
          <description>LCD Memory 24</description>
          <addressOffset>55</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM25</name>
          <description>LCD Memory 25</description>
          <addressOffset>56</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM26</name>
          <description>LCD Memory 26</description>
          <addressOffset>57</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM27</name>
          <description>LCD Memory 27</description>
          <addressOffset>58</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM28</name>
          <description>LCD Memory 28</description>
          <addressOffset>59</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM29</name>
          <description>LCD Memory 29</description>
          <addressOffset>60</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM30</name>
          <description>LCD Memory 30</description>
          <addressOffset>61</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM31</name>
          <description>LCD Memory 31</description>
          <addressOffset>62</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM32</name>
          <description>LCD Memory 32</description>
          <addressOffset>63</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM1</name>
          <description>LCD Blinking Memory 1</description>
          <addressOffset>64</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM33</name>
          <description>LCD Memory 33</description>
          <addressOffset>64</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM1</alternateRegister>
        </register>
        <register>
          <name>LCDBM2</name>
          <description>LCD Blinking Memory 2</description>
          <addressOffset>65</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM34</name>
          <description>LCD Memory 34</description>
          <addressOffset>65</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM2</alternateRegister>
        </register>
        <register>
          <name>LCDBM3</name>
          <description>LCD Blinking Memory 3</description>
          <addressOffset>66</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM35</name>
          <description>LCD Memory 35</description>
          <addressOffset>66</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM3</alternateRegister>
        </register>
        <register>
          <name>LCDBM4</name>
          <description>LCD Blinking Memory 4</description>
          <addressOffset>67</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM36</name>
          <description>LCD Memory 36</description>
          <addressOffset>67</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM4</alternateRegister>
        </register>
        <register>
          <name>LCDBM5</name>
          <description>LCD Blinking Memory 5</description>
          <addressOffset>68</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM37</name>
          <description>LCD Memory 37</description>
          <addressOffset>68</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM5</alternateRegister>
        </register>
        <register>
          <name>LCDBM6</name>
          <description>LCD Blinking Memory 6</description>
          <addressOffset>69</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM38</name>
          <description>LCD Memory 38</description>
          <addressOffset>69</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM6</alternateRegister>
        </register>
        <register>
          <name>LCDBM7</name>
          <description>LCD Blinking Memory 7</description>
          <addressOffset>70</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM39</name>
          <description>LCD Memory 39</description>
          <addressOffset>70</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM7</alternateRegister>
        </register>
        <register>
          <name>LCDBM8</name>
          <description>LCD Blinking Memory 8</description>
          <addressOffset>71</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM40</name>
          <description>LCD Memory 40</description>
          <addressOffset>71</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM8</alternateRegister>
        </register>
        <register>
          <name>LCDBM9</name>
          <description>LCD Blinking Memory 9</description>
          <addressOffset>72</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM41</name>
          <description>LCD Memory 41</description>
          <addressOffset>72</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM9</alternateRegister>
        </register>
        <register>
          <name>LCDBM10</name>
          <description>LCD Blinking Memory 10</description>
          <addressOffset>73</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM42</name>
          <description>LCD Memory 42</description>
          <addressOffset>73</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM10</alternateRegister>
        </register>
        <register>
          <name>LCDBM11</name>
          <description>LCD Blinking Memory 11</description>
          <addressOffset>74</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDM43</name>
          <description>LCD Memory 43</description>
          <addressOffset>74</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <alternateRegister>LCDBM11</alternateRegister>
        </register>
        <register>
          <name>LCDBM12</name>
          <description>LCD Blinking Memory 12</description>
          <addressOffset>75</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM13</name>
          <description>LCD Blinking Memory 13</description>
          <addressOffset>76</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM14</name>
          <description>LCD Blinking Memory 14</description>
          <addressOffset>77</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM15</name>
          <description>LCD Blinking Memory 15</description>
          <addressOffset>78</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM16</name>
          <description>LCD Blinking Memory 16</description>
          <addressOffset>79</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM17</name>
          <description>LCD Blinking Memory 17</description>
          <addressOffset>80</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM18</name>
          <description>LCD Blinking Memory 18</description>
          <addressOffset>81</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM19</name>
          <description>LCD Blinking Memory 19</description>
          <addressOffset>82</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM20</name>
          <description>LCD Blinking Memory 20</description>
          <addressOffset>83</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM21</name>
          <description>LCD Blinking Memory 21</description>
          <addressOffset>84</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>LCDBM22</name>
          <description>LCD Blinking Memory 22</description>
          <addressOffset>85</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
