chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>LCDCCTL0</name>
          <description>LCD_C Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDON</name>
              <description>LCD_C LCD On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDLP</name>
              <description>LCD_C Low Power Waveform</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDSON</name>
              <description>LCD_C LCD Segments On</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX0</name>
              <description>LCD_C Mux Rate Bit: 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX1</name>
              <description>LCD_C Mux Rate Bit: 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX2</name>
              <description>LCD_C Mux Rate Bit: 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDSSEL</name>
              <description>LCD_C Clock Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDPRE</name>
              <description>LCD_C LCD frequency pre-scaler Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDPRE_0</name>
                  <description>LCD_C LCD frequency pre-scaler: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDPRE_1</name>
                  <description>LCD_C LCD frequency pre-scaler: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDPRE_2</name>
                  <description>LCD_C LCD frequency pre-scaler: /4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDPRE_3</name>
                  <description>LCD_C LCD frequency pre-scaler: /8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDPRE_4</name>
                  <description>LCD_C LCD frequency pre-scaler: /16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDPRE_5</name>
                  <description>LCD_C LCD frequency pre-scaler: /32</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDDIV</name>
              <description>LCD_C LCD frequency divider Bit: 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDDIV_0</name>
                  <description>LCD_C LCD frequency divider: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_1</name>
                  <description>LCD_C LCD frequency divider: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_2</name>
                  <description>LCD_C LCD frequency divider: /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_3</name>
                  <description>LCD_C LCD frequency divider: /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_4</name>
                  <description>LCD_C LCD frequency divider: /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_5</name>
                  <description>LCD_C LCD frequency divider: /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_6</name>
                  <description>LCD_C LCD frequency divider: /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_7</name>
                  <description>LCD_C LCD frequency divider: /8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_8</name>
                  <description>LCD_C LCD frequency divider: /9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_9</name>
                  <description>LCD_C LCD frequency divider: /10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_10</name>
                  <description>LCD_C LCD frequency divider: /11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_11</name>
                  <description>LCD_C LCD frequency divider: /12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_12</name>
                  <description>LCD_C LCD frequency divider: /13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_13</name>
                  <description>LCD_C LCD frequency divider: /14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_14</name>
                  <description>LCD_C LCD frequency divider: /15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_15</name>
                  <description>LCD_C LCD frequency divider: /16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_16</name>
                  <description>LCD_C LCD frequency divider: /17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_17</name>
                  <description>LCD_C LCD frequency divider: /18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_18</name>
                  <description>LCD_C LCD frequency divider: /19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_19</name>
                  <description>LCD_C LCD frequency divider: /20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_20</name>
                  <description>LCD_C LCD frequency divider: /21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_21</name>
                  <description>LCD_C LCD frequency divider: /22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_22</name>
                  <description>LCD_C LCD frequency divider: /23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_23</name>
                  <description>LCD_C LCD frequency divider: /24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_24</name>
                  <description>LCD_C LCD frequency divider: /25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_25</name>
                  <description>LCD_C LCD frequency divider: /26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_26</name>
                  <description>LCD_C LCD frequency divider: /27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_27</name>
                  <description>LCD_C LCD frequency divider: /28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_28</name>
                  <description>LCD_C LCD frequency divider: /29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_29</name>
                  <description>LCD_C LCD frequency divider: /30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_30</name>
                  <description>LCD_C LCD frequency divider: /31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_31</name>
                  <description>LCD_C LCD frequency divider: /32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCCTL1</name>
          <description>LCD_C Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDFRMIFG</name>
              <description>LCD_C LCD frame interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKOFFIFG</name>
              <description>LCD_C LCD blinking off interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKONIFG</name>
              <description>LCD_C LCD blinking on interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDNOCAPIFG</name>
              <description>LCD_C No cpacitance connected interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDFRMIE</name>
              <description>LCD_C LCD frame interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKOFFIE</name>
              <description>LCD_C LCD blinking off interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKONIE</name>
              <description>LCD_C LCD blinking on interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDNOCAPIE</name>
              <description>LCD_C No cpacitance connected interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCBLKCTL</name>
          <description>LCD_C blinking control register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDBLKMOD</name>
              <description>LCD_C Blinking mode Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDBLKMOD_0</name>
                  <description>LCD_C Blinking mode: Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_1</name>
                  <description>LCD_C Blinking mode: Individual</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_2</name>
                  <description>LCD_C Blinking mode: All</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_3</name>
                  <description>LCD_C Blinking mode: Switching</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDBLKPRE</name>
              <description>LCD_C Clock pre-scaler for blinking frequency Bit: 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDBLKPRE_0</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_1</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_2</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_3</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_4</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_5</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_6</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_7</name>
                  <description>LCD_C Clock pre-scaler for blinking frequency: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDBLKDIV</name>
              <description>LCD_C Clock divider for blinking frequency Bit: 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDBLKDIV_0</name>
                  <description>LCD_C Clock divider for blinking frequency: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_1</name>
                  <description>LCD_C Clock divider for blinking frequency: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_2</name>
                  <description>LCD_C Clock divider for blinking frequency: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_3</name>
                  <description>LCD_C Clock divider for blinking frequency: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_4</name>
                  <description>LCD_C Clock divider for blinking frequency: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_5</name>
                  <description>LCD_C Clock divider for blinking frequency: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_6</name>
                  <description>LCD_C Clock divider for blinking frequency: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKDIV_7</name>
                  <description>LCD_C Clock divider for blinking frequency: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCMEMCTL</name>
          <description>LCD_C memory control register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDDISP</name>
              <description>LCD_C LCD memory registers for display</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCLRM</name>
              <description>LCD_C Clear LCD memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCLRBM</name>
              <description>LCD_C Clear LCD blinking memory</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
