chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>LCDCVCTL</name>
          <description>LCD_C Voltage Control Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCD2B</name>
              <description>Selects 1/2 bias.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLCDREF</name>
              <description>Selects reference voltage for regulated charge pump: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLCDREF_0</name>
                  <description>Internal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCDREF_1</name>
                  <description>External</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCDREF_2</name>
                  <description>Reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCDREF_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDCPEN</name>
              <description>LCD Voltage Charge Pump Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLCDEXT</name>
              <description>Select external source for VLCD.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDEXTBIAS</name>
              <description>V2 - V4 voltage select.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R03EXT</name>
              <description>Selects external connections for LCD mid voltages.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDREXT</name>
              <description>Selects external connection for lowest LCD voltage.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLCD</name>
              <description>VLCD select: 0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLCD_0</name>
                  <description>Charge pump disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_1</name>
                  <description>VLCD = 2.60V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_2</name>
                  <description>VLCD = 2.66V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_3</name>
                  <description>VLCD = 2.72V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_4</name>
                  <description>VLCD = 2.78V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_5</name>
                  <description>VLCD = 2.84V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_6</name>
                  <description>VLCD = 2.90V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_7</name>
                  <description>VLCD = 2.96V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_8</name>
                  <description>VLCD = 3.02V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_9</name>
                  <description>VLCD = 3.08V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_10</name>
                  <description>VLCD = 3.14V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_11</name>
                  <description>VLCD = 3.20V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_12</name>
                  <description>VLCD = 3.26V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_13</name>
                  <description>VLCD = 3.32V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_14</name>
                  <description>VLCD = 3.38V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLCD_15</name>
                  <description>VLCD = 3.44V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCPCTL0</name>
          <description>LCD_C Port Control Register 0</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDS0</name>
              <description>LCD Segment  0 enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS1</name>
              <description>LCD Segment  1 enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS2</name>
              <description>LCD Segment  2 enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS3</name>
              <description>LCD Segment  3 enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS4</name>
              <description>LCD Segment  4 enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS5</name>
              <description>LCD Segment  5 enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS6</name>
              <description>LCD Segment  6 enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS7</name>
              <description>LCD Segment  7 enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS8</name>
              <description>LCD Segment  8 enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS9</name>
              <description>LCD Segment  9 enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS10</name>
              <description>LCD Segment 10 enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS11</name>
              <description>LCD Segment 11 enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS12</name>
              <description>LCD Segment 12 enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS13</name>
              <description>LCD Segment 13 enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS14</name>
              <description>LCD Segment 14 enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS15</name>
              <description>LCD Segment 15 enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCPCTL1</name>
          <description>LCD_C Port Control Register 1</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDS16</name>
              <description>LCD Segment 16 enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS17</name>
              <description>LCD Segment 17 enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS18</name>
              <description>LCD Segment 18 enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS19</name>
              <description>LCD Segment 19 enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS20</name>
              <description>LCD Segment 20 enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS21</name>
              <description>LCD Segment 21 enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS22</name>
              <description>LCD Segment 22 enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS23</name>
              <description>LCD Segment 23 enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS24</name>
              <description>LCD Segment 24 enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS25</name>
              <description>LCD Segment 25 enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS26</name>
              <description>LCD Segment 26 enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS27</name>
              <description>LCD Segment 27 enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS28</name>
              <description>LCD Segment 28 enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS29</name>
              <description>LCD Segment 29 enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS30</name>
              <description>LCD Segment 30 enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS31</name>
              <description>LCD Segment 31 enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCPCTL2</name>
          <description>LCD_C Port Control Register 2</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDS32</name>
              <description>LCD Segment 32 enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS33</name>
              <description>LCD Segment 33 enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS34</name>
              <description>LCD Segment 34 enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS35</name>
              <description>LCD Segment 35 enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS36</name>
              <description>LCD Segment 36 enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS37</name>
              <description>LCD Segment 37 enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS38</name>
              <description>LCD Segment 38 enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS39</name>
              <description>LCD Segment 39 enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS40</name>
              <description>LCD Segment 40 enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS41</name>
              <description>LCD Segment 41 enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS42</name>
              <description>LCD Segment 42 enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS43</name>
              <description>LCD Segment 43 enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS44</name>
              <description>LCD Segment 44 enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS45</name>
              <description>LCD Segment 45 enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS46</name>
              <description>LCD Segment 46 enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDS47</name>
              <description>LCD Segment 47 enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCCPCTL</name>
          <description>LCD_C Charge Pump Control Register 3</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDCPDIS0</name>
              <description>LCD charge pump disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS1</name>
              <description>LCD charge pump disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS2</name>
              <description>LCD charge pump disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS3</name>
              <description>LCD charge pump disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS4</name>
              <description>LCD charge pump disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS5</name>
              <description>LCD charge pump disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS6</name>
              <description>LCD charge pump disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPDIS7</name>
              <description>LCD charge pump disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCPCLKSYNC</name>
              <description>LCD charge pump clock synchronization</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCIV</name>
          <description>LCD_C Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
