chrismolli/msp430fr6972/svd/msp430fr6972.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RC_FRAM</name>
      <description>RC  RAM Control Module (FRAM)</description>
      <baseAddress>344</baseAddress>
      <registers>
        <register>
          <name>RCCTL0</name>
          <description>Ram Controller Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RCRS0OFF</name>
              <description>RAM Controller RAM Sector 0 Off Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS0OFF_0</name>
                  <description>RAM Controller RAM Sector 0 Off : 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_1</name>
                  <description>RAM Controller RAM Sector 0 Off : 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_2</name>
                  <description>RAM Controller RAM Sector 0 Off : 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS0OFF_3</name>
                  <description>RAM Controller RAM Sector 0 Off : 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCRS1OFF</name>
              <description>RAM Controller RAM Sector 1 Off Bit: 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS1OFF_0</name>
                  <description>RAM Controller RAM Sector 1 Off : 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS1OFF_1</name>
                  <description>RAM Controller RAM Sector 1 Off : 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS1OFF_2</name>
                  <description>RAM Controller RAM Sector 1 Off : 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS1OFF_3</name>
                  <description>RAM Controller RAM Sector 1 Off : 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCRS2OFF</name>
              <description>RAM Controller RAM Sector 2 Off Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS2OFF_0</name>
                  <description>RAM Controller RAM Sector 2 Off : 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS2OFF_1</name>
                  <description>RAM Controller RAM Sector 2 Off : 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS2OFF_2</name>
                  <description>RAM Controller RAM Sector 2 Off : 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS2OFF_3</name>
                  <description>RAM Controller RAM Sector 2 Off : 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCRS3OFF</name>
              <description>RAM Controller RAM Sector 3 Off Bit: 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCRS3OFF_0</name>
                  <description>RAM Controller RAM Sector 3 Off : 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS3OFF_1</name>
                  <description>RAM Controller RAM Sector 3 Off : 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS3OFF_2</name>
                  <description>RAM Controller RAM Sector 3 Off : 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCRS3OFF_3</name>
                  <description>RAM Controller RAM Sector 3 Off : 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>348</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>WDT - Timer Interval Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTIS_0</name>
                  <description>WDT - Timer Interval Select: /2G</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_1</name>
                  <description>WDT - Timer Interval Select: /128M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_2</name>
                  <description>WDT - Timer Interval Select: /8192k</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_3</name>
                  <description>WDT - Timer Interval Select: /512k</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_4</name>
                  <description>WDT - Timer Interval Select: /32k</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_5</name>
                  <description>WDT - Timer Interval Select: /8192</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_6</name>
                  <description>WDT - Timer Interval Select: /512</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_7</name>
                  <description>WDT - Timer Interval Select: /64</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDT - Timer Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDT - Timer Mode Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>WDT - Timer Clock Source Select 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTSSEL_0</name>
                  <description>WDT - Timer Clock Source Select: SMCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_1</name>
                  <description>WDT - Timer Clock Source Select: ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_2</name>
                  <description>WDT - Timer Clock Source Select: VLO_CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_3</name>
                  <description>WDT - Timer Clock Source Select: reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDT - Timer hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
