chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>TA3EX0</name>
          <description>Timer3_A5 Expansion Register 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TAIDEX</name>
              <description>Timer A Input divider expansion Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAIDEX_0</name>
                  <description>Timer A Input divider expansion : /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_1</name>
                  <description>Timer A Input divider expansion : /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_2</name>
                  <description>Timer A Input divider expansion : /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_3</name>
                  <description>Timer A Input divider expansion : /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_4</name>
                  <description>Timer A Input divider expansion : /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_5</name>
                  <description>Timer A Input divider expansion : /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_6</name>
                  <description>Timer A Input divider expansion : /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIDEX_7</name>
                  <description>Timer A Input divider expansion : /8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TA3IV</name>
          <description>Timer3_A5 Interrupt Vector Word</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CAPACITIVE_TOUCH_IO_1</name>
      <description>Capacitive_Touch_IO 1</description>
      <baseAddress>1150</baseAddress>
      <registers>
        <register>
          <name>CAPTIO1CTL</name>
          <description>Capacitive_Touch_IO 1 control register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CAPTIOPISEL0</name>
              <description>CapTouchIO Pin Select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPISEL1</name>
              <description>CapTouchIO Pin Select Bit: 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPISEL2</name>
              <description>CapTouchIO Pin Select Bit: 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL0</name>
              <description>CapTouchIO Port Select Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL1</name>
              <description>CapTouchIO Port Select Bit: 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL2</name>
              <description>CapTouchIO Port Select Bit: 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL3</name>
              <description>CapTouchIO Port Select Bit: 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOEN</name>
              <description>CapTouchIO Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIO</name>
              <description>CapTouchIO state</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_16</name>
      <description>MPY 16  Multiplier  16 Bit Mode</description>
      <baseAddress>1216</baseAddress>
      <registers>
        <register>
          <name>MPY</name>
          <description>Multiply Unsigned/Operand 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS</name>
          <description>Multiply Signed/Operand 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC</name>
          <description>Multiply Unsigned and Accumulate/Operand 1</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS</name>
          <description>Multiply Signed and Accumulate/Operand 1</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2</name>
          <description>Operand 2</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESLO</name>
          <description>Result Low Word</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RESHI</name>
          <description>Result High Word</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SUMEXT</name>
          <description>Sum Extend</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32CTL0</name>
          <description>MPY32 Control Register 0</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPYC</name>
              <description>Carry of the multiplier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYFRAC</name>
              <description>Fractional mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYSAT</name>
              <description>Saturation mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYM</name>
              <description>Multiplier mode Bit:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPYM_0</name>
                  <description>Multiplier mode: MPY</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_1</name>
                  <description>Multiplier mode: MPYS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_2</name>
                  <description>Multiplier mode: MAC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPYM_3</name>
                  <description>Multiplier mode: MACS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OP1_32</name>
              <description>Bit-width of operand 1 0:16Bit / 1:32Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_32</name>
              <description>Bit-width of operand 2 0:16Bit / 1:32Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYDLYWRTEN</name>
              <description>Delayed write enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPYDLY32</name>
              <description>Delayed write mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
