chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>MPUIPSEGB1</name>
          <description>MPU IP Segment Border 1 Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPUIPSEGB10</name>
              <description>MPU IP Segment Border 1 Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB11</name>
              <description>MPU IP Segment Border 1 Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB12</name>
              <description>MPU IP Segment Border 1 Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB13</name>
              <description>MPU IP Segment Border 1 Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB14</name>
              <description>MPU IP Segment Border 1 Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB15</name>
              <description>MPU IP Segment Border 1 Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB16</name>
              <description>MPU IP Segment Border 1 Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB17</name>
              <description>MPU IP Segment Border 1 Bit: 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB18</name>
              <description>MPU IP Segment Border 1 Bit: 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB19</name>
              <description>MPU IP Segment Border 1 Bit: 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB110</name>
              <description>MPU IP Segment Border 1 Bit: 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB111</name>
              <description>MPU IP Segment Border 1 Bit: 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB112</name>
              <description>MPU IP Segment Border 1 Bit: 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB113</name>
              <description>MPU IP Segment Border 1 Bit: 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB114</name>
              <description>MPU IP Segment Border 1 Bit: 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB115</name>
              <description>MPU IP Segment Border 1 Bit: 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC12</name>
      <description>ADC12</description>
      <baseAddress>2048</baseAddress>
      <registers>
        <register>
          <name>ADC12CTL0</name>
          <description>ADC12 B Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12SC</name>
              <description>ADC12 Start Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ENC</name>
              <description>ADC12 Enable Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ON</name>
              <description>ADC12 On/enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12MSC</name>
              <description>ADC12 Multiple SampleConversion</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SHT0</name>
              <description>ADC12 Sample Hold 0 Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHT0_0</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_1</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_2</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_3</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_4</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_5</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_6</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_7</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_8</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_9</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_10</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_11</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_12</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_13</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_14</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT0_15</name>
                  <description>ADC12 Sample Hold 0 Select Bit: 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SHT1</name>
              <description>ADC12 Sample Hold 1 Select Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHT1_0</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_1</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_2</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_3</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_4</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_5</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_6</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_7</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_8</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_9</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_10</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_11</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_12</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_13</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_14</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHT1_15</name>
                  <description>ADC12 Sample Hold 1 Select Bit: 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12CTL1</name>
          <description>ADC12 B Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12BUSY</name>
              <description>ADC12 Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12CONSEQ</name>
              <description>ADC12 Conversion Sequence Select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12CONSEQ_0</name>
                  <description>ADC12 Conversion Sequence Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_1</name>
                  <description>ADC12 Conversion Sequence Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_2</name>
                  <description>ADC12 Conversion Sequence Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CONSEQ_3</name>
                  <description>ADC12 Conversion Sequence Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12SSEL</name>
              <description>ADC12 Clock Source Select Bit: 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SSEL_0</name>
                  <description>ADC12 Clock Source Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_1</name>
                  <description>ADC12 Clock Source Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_2</name>
                  <description>ADC12 Clock Source Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SSEL_3</name>
                  <description>ADC12 Clock Source Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIV</name>
              <description>ADC12 Clock Divider Select Bit: 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12DIV_0</name>
                  <description>ADC12 Clock Divider Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_1</name>
                  <description>ADC12 Clock Divider Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_2</name>
                  <description>ADC12 Clock Divider Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_3</name>
                  <description>ADC12 Clock Divider Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_4</name>
                  <description>ADC12 Clock Divider Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_5</name>
                  <description>ADC12 Clock Divider Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_6</name>
                  <description>ADC12 Clock Divider Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12DIV_7</name>
                  <description>ADC12 Clock Divider Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12ISSH</name>
              <description>ADC12 Invert Sample Hold Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SHP</name>
              <description>ADC12 Sample/Hold Pulse Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12SHS</name>
              <description>ADC12 Sample/Hold Source Bit: 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12SHS_0</name>
                  <description>ADC12 Sample/Hold Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_1</name>
                  <description>ADC12 Sample/Hold Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_2</name>
                  <description>ADC12 Sample/Hold Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_3</name>
                  <description>ADC12 Sample/Hold Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_4</name>
                  <description>ADC12 Sample/Hold Source: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_5</name>
                  <description>ADC12 Sample/Hold Source: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_6</name>
                  <description>ADC12 Sample/Hold Source: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12SHS_7</name>
                  <description>ADC12 Sample/Hold Source: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12PDIV</name>
              <description>ADC12 Predivider Bit: 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12PDIV_0</name>
                  <description>ADC12 Clock predivider Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12PDIV_1</name>
                  <description>ADC12 Clock predivider Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12PDIV_2</name>
                  <description>ADC12 Clock predivider Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12PDIV_3</name>
                  <description>ADC12 Clock predivider Select 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
