chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>ADC12CTL2</name>
          <description>ADC12 B Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12PWRMD</name>
              <description>ADC12 Power Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12DF</name>
              <description>ADC12 Data Format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12RES</name>
              <description>ADC12 Resolution Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12RES_0</name>
                  <description>ADC12+ Resolution : 8 Bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_1</name>
                  <description>ADC12+ Resolution : 10 Bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_2</name>
                  <description>ADC12+ Resolution : 12 Bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12RES_3</name>
                  <description>ADC12+ Resolution : reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12CTL3</name>
          <description>ADC12 B Control 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12CSTARTADD</name>
              <description>ADC12 Conversion Start Address Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_0</name>
                  <description>ADC12 Conversion Start Address: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_1</name>
                  <description>ADC12 Conversion Start Address: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_2</name>
                  <description>ADC12 Conversion Start Address: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_3</name>
                  <description>ADC12 Conversion Start Address: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_4</name>
                  <description>ADC12 Conversion Start Address: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_5</name>
                  <description>ADC12 Conversion Start Address: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_6</name>
                  <description>ADC12 Conversion Start Address: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_7</name>
                  <description>ADC12 Conversion Start Address: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_8</name>
                  <description>ADC12 Conversion Start Address: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_9</name>
                  <description>ADC12 Conversion Start Address: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_10</name>
                  <description>ADC12 Conversion Start Address: 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_11</name>
                  <description>ADC12 Conversion Start Address: 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_12</name>
                  <description>ADC12 Conversion Start Address: 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_13</name>
                  <description>ADC12 Conversion Start Address: 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_14</name>
                  <description>ADC12 Conversion Start Address: 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_15</name>
                  <description>ADC12 Conversion Start Address: 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_16</name>
                  <description>ADC12 Conversion Start Address: 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_17</name>
                  <description>ADC12 Conversion Start Address: 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_18</name>
                  <description>ADC12 Conversion Start Address: 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_19</name>
                  <description>ADC12 Conversion Start Address: 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_20</name>
                  <description>ADC12 Conversion Start Address: 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_21</name>
                  <description>ADC12 Conversion Start Address: 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_22</name>
                  <description>ADC12 Conversion Start Address: 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_23</name>
                  <description>ADC12 Conversion Start Address: 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_24</name>
                  <description>ADC12 Conversion Start Address: 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_25</name>
                  <description>ADC12 Conversion Start Address: 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_26</name>
                  <description>ADC12 Conversion Start Address: 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_27</name>
                  <description>ADC12 Conversion Start Address: 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_28</name>
                  <description>ADC12 Conversion Start Address: 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_29</name>
                  <description>ADC12 Conversion Start Address: 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_30</name>
                  <description>ADC12 Conversion Start Address: 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12CSTARTADD_31</name>
                  <description>ADC12 Conversion Start Address: 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12BATMAP</name>
              <description>ADC12 Internal AVCC/2 select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12TCMAP</name>
              <description>ADC12 Internal TempSensor select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ICH0MAP</name>
              <description>ADC12 Internal Channel 0 select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ICH1MAP</name>
              <description>ADC12 Internal Channel 1 select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ICH2MAP</name>
              <description>ADC12 Internal Channel 2 select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12ICH3MAP</name>
              <description>ADC12 Internal Channel 3 select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC12LO</name>
          <description>ADC12 B Window Comparator High Threshold</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12HI</name>
          <description>ADC12 B Window Comparator High Threshold</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADC12IFGR0</name>
          <description>ADC12 B Interrupt Flag 0</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12IFG0</name>
              <description>ADC12 Memory 0 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG1</name>
              <description>ADC12 Memory 1 Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG2</name>
              <description>ADC12 Memory 2 Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG3</name>
              <description>ADC12 Memory 3 Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG4</name>
              <description>ADC12 Memory 4 Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG5</name>
              <description>ADC12 Memory 5 Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG6</name>
              <description>ADC12 Memory 6 Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG7</name>
              <description>ADC12 Memory 7 Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG8</name>
              <description>ADC12 Memory 8 Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG9</name>
              <description>ADC12 Memory 9 Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG10</name>
              <description>ADC12 Memory 10 Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG11</name>
              <description>ADC12 Memory 11 Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG12</name>
              <description>ADC12 Memory 12 Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG13</name>
              <description>ADC12 Memory 13 Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG14</name>
              <description>ADC12 Memory 14 Interrupt Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG15</name>
              <description>ADC12 Memory 15 Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADC12IFGR1</name>
          <description>ADC12 B Interrupt Flag 1</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12IFG16</name>
              <description>ADC12 Memory 16 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG17</name>
              <description>ADC12 Memory 17 Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG18</name>
              <description>ADC12 Memory 18 Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG19</name>
              <description>ADC12 Memory 19 Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG20</name>
              <description>ADC12 Memory 20 Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG21</name>
              <description>ADC12 Memory 21 Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG22</name>
              <description>ADC12 Memory 22 Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG23</name>
              <description>ADC12 Memory 23 Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG24</name>
              <description>ADC12 Memory 24 Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG25</name>
              <description>ADC12 Memory 25 Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG26</name>
              <description>ADC12 Memory 26 Interrupt Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG27</name>
              <description>ADC12 Memory 27 Interrupt Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG28</name>
              <description>ADC12 Memory 28 Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG29</name>
              <description>ADC12 Memory 29 Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG30</name>
              <description>ADC12 Memory 30 Interrupt Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12IFG31</name>
              <description>ADC12 Memory 31 Interrupt Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADC12IFGR2</name>
          <description>ADC12 B Interrupt Flag 2</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12INIFG</name>
              <description>ADC12 Interrupt Flag for the inside of window of the Window comparator</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12LOIFG</name>
              <description>ADC12 Interrupt Flag for lower threshold of the Window comparator</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12HIIFG</name>
              <description>ADC12 Interrupt Flag for upper threshold of the Window comparator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12OVIFG</name>
              <description>ADC12 ADC12MEMx Overflow interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12TOVIFG</name>
              <description>ADC12 Timer Overflow interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12RDYIFG</name>
              <description>ADC12 local buffered reference ready interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
