chrismolli/msp430fr6972/svd/msp430fr6972.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMPARATOR_E</name>
      <description>Comparator E</description>
      <baseAddress>2240</baseAddress>
      <registers>
        <register>
          <name>CECTL0</name>
          <description>Comparator E Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CEIPSEL</name>
              <description>Comp. E Pos. Channel Input Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIPSEL_0</name>
                  <description>Comp. E V+ terminal Input Select: Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_1</name>
                  <description>Comp. E V+ terminal Input Select: Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_2</name>
                  <description>Comp. E V+ terminal Input Select: Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_3</name>
                  <description>Comp. E V+ terminal Input Select: Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_4</name>
                  <description>Comp. E V+ terminal Input Select: Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_5</name>
                  <description>Comp. E V+ terminal Input Select: Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_6</name>
                  <description>Comp. E V+ terminal Input Select: Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_7</name>
                  <description>Comp. E V+ terminal Input Select: Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_8</name>
                  <description>Comp. E V+ terminal Input Select: Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_9</name>
                  <description>Comp. E V+ terminal Input Select: Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_10</name>
                  <description>Comp. E V+ terminal Input Select: Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_11</name>
                  <description>Comp. E V+ terminal Input Select: Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_12</name>
                  <description>Comp. E V+ terminal Input Select: Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_13</name>
                  <description>Comp. E V+ terminal Input Select: Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_14</name>
                  <description>Comp. E V+ terminal Input Select: Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIPSEL_15</name>
                  <description>Comp. E V+ terminal Input Select: Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIPEN</name>
              <description>Comp. E Pos. Channel Input Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEIMSEL</name>
              <description>Comp. E Neg. Channel Input Select 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEIMSEL_0</name>
                  <description>Comp. E V- Terminal Input Select: Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_1</name>
                  <description>Comp. E V- Terminal Input Select: Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_2</name>
                  <description>Comp. E V- Terminal Input Select: Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_3</name>
                  <description>Comp. E V- Terminal Input Select: Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_4</name>
                  <description>Comp. E V- Terminal Input Select: Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_5</name>
                  <description>Comp. E V- Terminal Input Select: Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_6</name>
                  <description>Comp. E V- Terminal Input Select: Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_7</name>
                  <description>Comp. E V- Terminal Input Select: Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_8</name>
                  <description>Comp. E V- terminal Input Select: Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_9</name>
                  <description>Comp. E V- terminal Input Select: Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_10</name>
                  <description>Comp. E V- terminal Input Select: Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_11</name>
                  <description>Comp. E V- terminal Input Select: Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_12</name>
                  <description>Comp. E V- terminal Input Select: Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_13</name>
                  <description>Comp. E V- terminal Input Select: Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_14</name>
                  <description>Comp. E V- terminal Input Select: Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEIMSEL_15</name>
                  <description>Comp. E V- terminal Input Select: Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIMEN</name>
              <description>Comp. E Neg. Channel Input Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CECTL1</name>
          <description>Comparator E Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CEOUT</name>
              <description>Comp. E Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEOUTPOL</name>
              <description>Comp. E Output Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEF</name>
              <description>Comp. E Enable Output Filter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEIES</name>
              <description>Comp. E Interrupt Edge Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CESHORT</name>
              <description>Comp. E Input Short</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEEX</name>
              <description>Comp. E Exchange Inputs</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEFDLY</name>
              <description>Comp. E Filter delay Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEFDLY_0</name>
                  <description>Comp. E Filter delay 0 : 450ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_1</name>
                  <description>Comp. E Filter delay 1 : 900ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_2</name>
                  <description>Comp. E Filter delay 2 : 1800ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEFDLY_3</name>
                  <description>Comp. E Filter delay 3 : 3600ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEPWRMD</name>
              <description>Comp. E Power mode Bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEPWRMD_0</name>
                  <description>Comp. E Power mode 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPWRMD_1</name>
                  <description>Comp. E Power mode 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPWRMD_2</name>
                  <description>Comp. E Power mode 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEPWRMD_3</name>
                  <description>Comp. E Power mode 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEON</name>
              <description>Comp. E enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEMRVL</name>
              <description>Comp. E CEMRV Level</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEMRVS</name>
              <description>Comp. E Output selects between VREF0 or VREF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
