chrismolli/msp430fr6972/svd/msp430fr6972.svd
        <register>
          <name>CECTL2</name>
          <description>Comparator E Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CEREF0</name>
              <description>Comp. E Reference 0 Resistor Select Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEREF0_0</name>
                  <description>Comp. E Int. Ref.0 Select 0 : 1/32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_1</name>
                  <description>Comp. E Int. Ref.0 Select 1 : 2/32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_2</name>
                  <description>Comp. E Int. Ref.0 Select 2 : 3/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_3</name>
                  <description>Comp. E Int. Ref.0 Select 3 : 4/32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_4</name>
                  <description>Comp. E Int. Ref.0 Select 4 : 5/32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_5</name>
                  <description>Comp. E Int. Ref.0 Select 5 : 6/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_6</name>
                  <description>Comp. E Int. Ref.0 Select 6 : 7/32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_7</name>
                  <description>Comp. E Int. Ref.0 Select 7 : 8/32</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_8</name>
                  <description>Comp. E Int. Ref.0 Select 0 : 9/32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_9</name>
                  <description>Comp. E Int. Ref.0 Select 1 : 10/32</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_10</name>
                  <description>Comp. E Int. Ref.0 Select 2 : 11/32</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_11</name>
                  <description>Comp. E Int. Ref.0 Select 3 : 12/32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_12</name>
                  <description>Comp. E Int. Ref.0 Select 4 : 13/32</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_13</name>
                  <description>Comp. E Int. Ref.0 Select 5 : 14/32</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_14</name>
                  <description>Comp. E Int. Ref.0 Select 6 : 15/32</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_15</name>
                  <description>Comp. E Int. Ref.0 Select 7 : 16/32</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_16</name>
                  <description>Comp. E Int. Ref.0 Select 0 : 17/32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_17</name>
                  <description>Comp. E Int. Ref.0 Select 1 : 18/32</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_18</name>
                  <description>Comp. E Int. Ref.0 Select 2 : 19/32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_19</name>
                  <description>Comp. E Int. Ref.0 Select 3 : 20/32</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_20</name>
                  <description>Comp. E Int. Ref.0 Select 4 : 21/32</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_21</name>
                  <description>Comp. E Int. Ref.0 Select 5 : 22/32</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_22</name>
                  <description>Comp. E Int. Ref.0 Select 6 : 23/32</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_23</name>
                  <description>Comp. E Int. Ref.0 Select 7 : 24/32</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_24</name>
                  <description>Comp. E Int. Ref.0 Select 0 : 25/32</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_25</name>
                  <description>Comp. E Int. Ref.0 Select 1 : 26/32</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_26</name>
                  <description>Comp. E Int. Ref.0 Select 2 : 27/32</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_27</name>
                  <description>Comp. E Int. Ref.0 Select 3 : 28/32</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_28</name>
                  <description>Comp. E Int. Ref.0 Select 4 : 29/32</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_29</name>
                  <description>Comp. E Int. Ref.0 Select 5 : 30/32</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_30</name>
                  <description>Comp. E Int. Ref.0 Select 6 : 31/32</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF0_31</name>
                  <description>Comp. E Int. Ref.0 Select 7 : 32/32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CERSEL</name>
              <description>Comp. E Reference select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CERS</name>
              <description>Comp. E Reference Source Bit : 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CERS_0</name>
                  <description>Comp. E Reference Source 0 : Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_1</name>
                  <description>Comp. E Reference Source 1 : Vcc</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_2</name>
                  <description>Comp. E Reference Source 2 : Shared Ref.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CERS_3</name>
                  <description>Comp. E Reference Source 3 : Shared Ref. / Off</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEREF1</name>
              <description>Comp. E Reference 1 Resistor Select Bit : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEREF1_0</name>
                  <description>Comp. E Int. Ref.1 Select 0 : 1/32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_1</name>
                  <description>Comp. E Int. Ref.1 Select 1 : 2/32</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_2</name>
                  <description>Comp. E Int. Ref.1 Select 2 : 3/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_3</name>
                  <description>Comp. E Int. Ref.1 Select 3 : 4/32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_4</name>
                  <description>Comp. E Int. Ref.1 Select 4 : 5/32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_5</name>
                  <description>Comp. E Int. Ref.1 Select 5 : 6/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_6</name>
                  <description>Comp. E Int. Ref.1 Select 6 : 7/32</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_7</name>
                  <description>Comp. E Int. Ref.1 Select 7 : 8/32</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_8</name>
                  <description>Comp. E Int. Ref.1 Select 0 : 9/32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_9</name>
                  <description>Comp. E Int. Ref.1 Select 1 : 10/32</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_10</name>
                  <description>Comp. E Int. Ref.1 Select 2 : 11/32</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_11</name>
                  <description>Comp. E Int. Ref.1 Select 3 : 12/32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_12</name>
                  <description>Comp. E Int. Ref.1 Select 4 : 13/32</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_13</name>
                  <description>Comp. E Int. Ref.1 Select 5 : 14/32</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_14</name>
                  <description>Comp. E Int. Ref.1 Select 6 : 15/32</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_15</name>
                  <description>Comp. E Int. Ref.1 Select 7 : 16/32</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_16</name>
                  <description>Comp. E Int. Ref.1 Select 0 : 17/32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_17</name>
                  <description>Comp. E Int. Ref.1 Select 1 : 18/32</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_18</name>
                  <description>Comp. E Int. Ref.1 Select 2 : 19/32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_19</name>
                  <description>Comp. E Int. Ref.1 Select 3 : 20/32</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_20</name>
                  <description>Comp. E Int. Ref.1 Select 4 : 21/32</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_21</name>
                  <description>Comp. E Int. Ref.1 Select 5 : 22/32</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_22</name>
                  <description>Comp. E Int. Ref.1 Select 6 : 23/32</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_23</name>
                  <description>Comp. E Int. Ref.1 Select 7 : 24/32</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_24</name>
                  <description>Comp. E Int. Ref.1 Select 0 : 25/32</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_25</name>
                  <description>Comp. E Int. Ref.1 Select 1 : 26/32</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_26</name>
                  <description>Comp. E Int. Ref.1 Select 2 : 27/32</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_27</name>
                  <description>Comp. E Int. Ref.1 Select 3 : 28/32</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_28</name>
                  <description>Comp. E Int. Ref.1 Select 4 : 29/32</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_29</name>
                  <description>Comp. E Int. Ref.1 Select 5 : 30/32</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_30</name>
                  <description>Comp. E Int. Ref.1 Select 6 : 31/32</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREF1_31</name>
                  <description>Comp. E Int. Ref.1 Select 7 : 32/32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEREFL</name>
              <description>Comp. E Reference voltage level Bit : 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEREFL_0</name>
                  <description>Comp. E Reference voltage level 0 : None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREFL_1</name>
                  <description>Comp. E Reference voltage level 1 : 1.2V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREFL_2</name>
                  <description>Comp. E Reference voltage level 2 : 2.0V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEREFL_3</name>
                  <description>Comp. E Reference voltage level 3 : 2.5V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEREFACC</name>
              <description>Comp. E Reference Accuracy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CECTL3</name>
          <description>Comparator E Control Register 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CEPD0</name>
              <description>Comp. E Disable Input Buffer of Port Register .0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD1</name>
              <description>Comp. E Disable Input Buffer of Port Register .1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD2</name>
              <description>Comp. E Disable Input Buffer of Port Register .2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD3</name>
              <description>Comp. E Disable Input Buffer of Port Register .3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD4</name>
              <description>Comp. E Disable Input Buffer of Port Register .4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD5</name>
              <description>Comp. E Disable Input Buffer of Port Register .5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD6</name>
              <description>Comp. E Disable Input Buffer of Port Register .6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD7</name>
              <description>Comp. E Disable Input Buffer of Port Register .7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD8</name>
              <description>Comp. E Disable Input Buffer of Port Register .8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD9</name>
              <description>Comp. E Disable Input Buffer of Port Register .9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD10</name>
              <description>Comp. E Disable Input Buffer of Port Register .10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD11</name>
              <description>Comp. E Disable Input Buffer of Port Register .11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD12</name>
              <description>Comp. E Disable Input Buffer of Port Register .12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD13</name>
              <description>Comp. E Disable Input Buffer of Port Register .13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD14</name>
              <description>Comp. E Disable Input Buffer of Port Register .14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEPD15</name>
              <description>Comp. E Disable Input Buffer of Port Register .15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
