chrismolli/msp430fr6972/svd/msp430fr6972.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>AES256</name>
        <description>0xFFC6 AES256</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>0xFFC8 RTC</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LCD_C</name>
        <description>0xFFCA LCD C</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>PORT4</name>
        <description>0xFFCC Port 4</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>PORT3</name>
        <description>0xFFCE Port 3</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A1</name>
        <description>0xFFD0 Timer3_A2 CC1, TA</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_A0</name>
        <description>0xFFD2 Timer3_A2 CC0</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFD4 Port 2</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A1</name>
        <description>0xFFD6 Timer2_A3 CC1, TA</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_A0</name>
        <description>0xFFD8 Timer2_A3 CC0</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFDA Port 1</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFDC Timer1_A3 CC1-2, TA1</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFDE Timer1_A3 CC0</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>DMA</name>
        <description>0xFFE0 DMA</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>USCI_B1</name>
        <description>0xFFE2 USCI B1 Receive/Transmit</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>USCI_A1</name>
        <description>0xFFE4 USCI A1 Receive/Transmit</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFE6 Timer0_A5 CC1-4, TA</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFE8 Timer0_A5 CC0</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>ADC12</name>
        <description>0xFFEA ADC</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>USCI_B0</name>
        <description>0xFFEC USCI B0 Receive/Transmit</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>USCI_A0</name>
        <description>0xFFEE USCI A0 Receive/Transmit</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF2 Watchdog Timer</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B1</name>
        <description>0xFFF4 Timer0_B3 CC1-2, TB</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_B0</name>
        <description>0xFFF6 Timer0_B3 CC0</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>COMP_E</name>
        <description>0xFFF8 Comparator E</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA User Non-maskable</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC System Non-maskable</description>
        <value>54</value>
      </interrupt>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <msp430_svd>
      <version>0.2.0</version>
      <commit_hash>92826fe</commit_hash>
    </msp430_svd>
  </vendorExtensions>
</device>
